grblHAL/ESP32/main/uart_serial.c
void serialRegisterStreams (void)
{
    static io_stream_details_t streams = {
        .n_streams = sizeof(serial) / sizeof(io_stream_properties_t),
        .streams = serial,
    };

    static const periph_pin_t tx0 = {
        .function = Output_TX,
        .group = PinGroup_UART,
        .pin = UART_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t rx0 = {
        .function = Input_RX,
        .group = PinGroup_UART,
        .pin = UART_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx0);
    hal.periph_port.register_pin(&tx0);

#ifdef SERIAL1_PORT

  #ifdef UART1_TX_PIN
    static const periph_pin_t tx1 = {
        .function = Output_TX,
        .group = PinGroup_UART2,
        .pin = UART1_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    hal.periph_port.register_pin(&tx1);
  #endif

    static const periph_pin_t rx1 = {
        .function = Input_RX,
        .group = PinGroup_UART2,
        .pin = UART1_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx1);

#endif // SERIAL1_PORT

#ifdef SERIAL2_PORT

  #ifdef UART2_TX_PIN
    static const periph_pin_t tx2 = {
        .function = Output_TX,
        .group = PinGroup_UART3,
        .pin = UART2_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    hal.periph_port.register_pin(&tx2);
  #endif

    static const periph_pin_t rx2 = {
        .function = Input_RX,
        .group = PinGroup_UART3,
        .pin = UART2_RX_PIN,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&rx2);

#endif // SERIAL2_PORT

    stream_register_streams(&streams);
}

static const io_stream_status_t *get_uart_status (uint8_t instance)
{
    stream_status[instance].flags = serial[instance].flags;

    return &stream_status[instance];
}

static void uartSetBaudRate (uart_t *uart, uint32_t baud_rate)
{
    if(uart == NULL)
        return;

    UART_MUTEX_LOCK(uart);
    uart_ll_set_baudrate(uart->dev, baud_rate);
    UART_MUTEX_UNLOCK(uart);
}

static void uartSetFormat (uart_t *uart, serial_format_t format)
{
    UART_MUTEX_LOCK(uart);
    uart_ll_set_parity(uart->dev, format.parity == Serial_ParityNone
                                   ? UART_PARITY_DISABLE
                                   : (format.parity == Serial_ParityEven ? UART_PARITY_EVEN : UART_PARITY_ODD));
    UART_MUTEX_UNLOCK(uart);
}

static void uartConfig (uart_t *uart, uint32_t baud_rate)
{
#if !CONFIG_DISABLE_HAL_LOCKS
    if(uart->lock == NULL) {
        uart->lock = xSemaphoreCreateMutex();
        if(uart->lock == NULL)
            return;
    }
#endif

//    uart->tx_len = 128;
    uart_ll_set_mode(uart->dev, UART_MODE_UART);

#if CONFIG_IDF_TARGET_ESP32S3

    periph_module_reset((periph_module_t)(PERIPH_UART0_MODULE + uart->num));
    periph_module_enable((periph_module_t)(PERIPH_UART0_MODULE + uart->num));

#else
    switch(uart->num) {

        case 0:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART_RST);
            break;

        case 1:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART1_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART1_RST);
            break;

        case 2:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART2_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART2_RST);
            break;
    }
#endif

    uartSetBaudRate(uart, baud_rate);

    UART_MUTEX_LOCK(uart);

    uart_ll_set_data_bit_num(uart->dev, UART_DATA_8_BITS);
    uart_ll_set_stop_bits(uart->dev, UART_STOP_BITS_1);
    uart_ll_set_parity(uart->dev, UART_PARITY_DISABLE);

    // Note: UART0 pin mappings are set at boot, no need to set here unless override is required

#if CONFIG_IDF_TARGET_ESP32S3
#if UART_RX_PIN != 44 || UART_TX_PIN != 43
#define UART0_PINS_REDEFINED
#endif
#else
#if UART_RX_PIN != 34 || UART_TX_PIN != 35
#define UART0_PINS_REDEFINED
#endif
#endif

#if defined(SERIAL1_PORT) || defined(SERIAL2_PORT) || defined(UART0_PINS_REDEFINED)

    switch(uart->num) {
 #ifdef UART0_PINS_REDEFINED
		case 0:
			uart_set_pin(uart->num, UART_TX_PIN, UART_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
			break;
 #endif
 #ifdef SERIAL1_PORT
        case 1:
  #ifdef UART1_TX_PIN
            uart_set_pin(uart->num, UART1_TX_PIN, UART1_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #else
            uart_set_pin(uart->num, UART_PIN_NO_CHANGE, UART1_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #endif
            break;
 #endif
 #ifdef SERIAL2_PORT
        case 2:
  #ifdef UART2_TX_PIN
            uart_set_pin(uart->num, UART2_TX_PIN, UART2_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #else
            uart_set_pin(uart->num, UART_PIN_NO_CHANGE, UART2_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #endif
            break;
 #endif
}
#endif // SERIAL1_PORT ||  SERIAL2_PORT

    UART_MUTEX_UNLOCK(uart);
}

static void uartEnableInterrupt (uart_t *uart, uart_isr_ptr isr, bool enable_rx)
{
    UART_MUTEX_LOCK(uart);

    if(!uart->intr_handle)
        esp_intr_alloc(UART_INTR_SOURCE(uart->num), (int)ESP_INTR_FLAG_IRAM, isr, NULL, &uart->intr_handle);

    uart_ll_set_rxfifo_full_thr(uart->dev, 112);
    uart_ll_set_rx_tout(uart->dev, enable_rx ? 50 : 0);
    uart_ll_clr_intsts_mask(uart->dev, rx_int_flags);
    if(enable_rx)
        uart_ll_ena_intr_mask(uart->dev, rx_int_flags);
    else
        uart_ll_disable_intr_mask(uart->dev, rx_int_flags);

    UART_MUTEX_UNLOCK(uart);
}

IRAM_ATTR static void _uart_flush (uart_t *uart, bool tx_only)
{
    uart_ll_txfifo_rst(uart->dev);
    while(!uart_ll_is_tx_idle(uart->dev));

    if(!tx_only)
        uart_ll_rxfifo_rst(uart->dev);
}

FORCE_INLINE_ATTR uint8_t _uart_ll_read_rxfifo (uart_dev_t *hw)
{
    uint8_t c;
    //Get the UART APB fifo addr. Read fifo, we use APB address
    uint32_t fifo_addr = (hw == &UART0) ? UART_FIFO_REG(0) : (hw == &UART1) ? UART_FIFO_REG(1) : UART_FIFO_REG(2);

    c = READ_PERI_REG(fifo_addr);
#ifdef CONFIG_COMPILER_OPTIMIZATION_PERF
    __asm__ __volatile__("nop");
#endif

    return c;
}

FORCE_INLINE_ATTR void _uart_ll_write_txfifo (uart_dev_t *hw, const uint8_t c)
{
    //Get the UART AHB fifo addr, Write fifo, we use AHB address
    uint32_t fifo_addr = (hw == &UART0) ? UART_FIFO_AHB_REG(0) : (hw == &UART1) ? UART_FIFO_AHB_REG(1) : UART_FIFO_AHB_REG(2);

