grblHAL/ESP32/main/uart_serial.c
    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

uint16_t static serial1TxCount (void)
{
#ifdef UART1_TX_PIN
    return uart_ll_is_tx_idle(uart1.dev) ? 0 : (uint16_t)_uart_ll_get_txfifo_count(uart1.dev) + 1;
#else
    return 0;
#endif
}

uint16_t static serial1RXFree (void)
{
    uint16_t head = rxbuffer1.head, tail = rxbuffer1.tail;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

static bool serial1PutC (const char c)
{
#ifdef UART1_TX_PIN
    UART_MUTEX_LOCK(&uart1);

    while(_uart_ll_get_txfifo_count(uart1.dev) == uart1.tx_len) {
        if(!hal.stream_blocking_callback())
            return false;
    }

    _uart_ll_write_txfifo(uart1.dev, c);

    UART_MUTEX_UNLOCK(&uart1);
#endif

    return true;
}

void static serial1WriteS (const char *data)
{
#ifdef UART1_TX_PIN
    char c, *ptr = (char *)data;

    while((c = *ptr++) != '\0')
        serial1PutC(c);
#endif
}

//
// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
void static serial1Write (const char *s, uint16_t length)
{
#ifdef UART1_TX_PIN
    char *ptr = (char *)s;

    while(length--)
        serial1PutC(*ptr++);
#endif
}

int16_t static serial1Read (void)
{
    UART_MUTEX_LOCK(&uart1);

    int16_t data;
    uint16_t bptr = rxbuffer1.tail;

    if(bptr == rxbuffer1.head) {
        UART_MUTEX_UNLOCK(&uart1);
        return -1; // no data available else EOF
    }

    data = rxbuffer1.data[bptr++];                 // Get next character, increment tmp pointer
    rxbuffer1.tail = bptr & (RX_BUFFER_SIZE - 1);  // and update pointer

    UART_MUTEX_UNLOCK(&uart1);

    return data;
}

IRAM_ATTR static void serial1Flush (void)
{
    UART_MUTEX_LOCK(&uart1);

    _uart_flush(&uart1, false);

    rxbuffer1.tail = rxbuffer1.head;
    rxbuffer1.overflow = Off;

    UART_MUTEX_UNLOCK(&uart1);
}

IRAM_ATTR static void serial1TxFlush (void)
{
#ifdef UART1_TX_PIN
    UART_MUTEX_LOCK(&uart1);

    _uart_flush(&uart1, true);

    UART_MUTEX_UNLOCK(&uart1);
#endif
}

IRAM_ATTR static void serial1Cancel (void)
{
    UART_MUTEX_LOCK(&uart1);

    rxbuffer1.data[rxbuffer1.head] = ASCII_CAN;
    rxbuffer1.tail = rxbuffer1.head;
    rxbuffer1.head = (rxbuffer1.tail + 1) & (RX_BUFFER_SIZE - 1);

    UART_MUTEX_UNLOCK(&uart1);
}

static bool serial1SuspendInput (bool suspend)
{
    bool ok;

    UART_MUTEX_LOCK(&uart1);

    ok = stream_rx_suspend(&rxbuffer1, suspend);

    UART_MUTEX_UNLOCK(&uart1);

    return ok;
}

IRAM_ATTR static bool serial1Disable (bool disable)
{
    UART_MUTEX_LOCK(&uart1);

    uart_ll_disable_intr_mask(uart1.dev, rx_int_flags);

    serial1WriteS(uitoa(disable));
    serial1WriteS(ASCII_EOL);

    if(!disable) {
        // Clear and enable interrupts
        _uart_flush(&uart1, false);
        rxbuffer1.tail = rxbuffer1.head;
        uart_ll_clr_intsts_mask(uart1.dev, rx_int_flags);
        uart_ll_ena_intr_mask(uart1.dev, rx_int_flags);
    }

    UART_MUTEX_UNLOCK(&uart1);

    return true;
}

static bool serial1SetBaudRate (uint32_t baud_rate)
{
    stream_status[1].baud_rate = baud_rate;

    uartSetBaudRate(&uart1, baud_rate);

    return true;
}

static bool serial1SetFormat (serial_format_t format)
{
    stream_status[1].format = format;

    uartSetFormat(&uart1, format);

    return true;
}

static bool serial1EnqueueRtCommand (char c)
{
    return enqueue_realtime_command2(c);
}

static enqueue_realtime_command_ptr serial1SetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command2;

    if(handler)
        enqueue_realtime_command2 = handler;

    return prev;
}

static const io_stream_t *serial1Init (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 1,
        .is_connected = stream_connected,
        .read = serial1Read,
        .write = serial1WriteS,
        .write_n =  serial1Write,
        .write_char = serial1PutC,
        .enqueue_rt_command = serial1EnqueueRtCommand,
        .get_rx_buffer_free = serial1RXFree,
        .get_rx_buffer_count = serial1Available,
        .get_tx_buffer_count = serial1TxCount,
        .reset_write_buffer = serial1TxFlush,
        .reset_read_buffer = serial1Flush,
        .cancel_read_buffer = serial1Cancel,
        .suspend_read = serial1SuspendInput,
        .set_baud_rate = serial1SetBaudRate,
        .set_format = serial1SetFormat,
        .disable_rx = serial1Disable,
        .set_enqueue_rt_handler = serial1SetRtHandler
    };

    if(serial[1].flags.claimed)
        return NULL;

    serial[1].flags.claimed = On;
    stream_status[1].baud_rate = baud_rate;

    memcpy(&uart1, &_uart_bus_array[1], sizeof(uart_t)); // use UART 1

    uartConfig(&uart1, baud_rate);

    serial1Flush();

    uartEnableInterrupt(&uart1, _uart1_isr, true);
#ifndef UART1_TX_PIN
    serial1Disable(true); // for MPG mode
#endif

    return &stream;
}

#endif // SERIAL1_PORT

#ifdef SERIAL2_PORT

static void IRAM_ATTR _uart2_isr (void *arg)
{
    uint32_t c, cnt = uart_ll_get_rxfifo_len(uart2.dev), iflags = uart_ll_get_intsts_mask(uart2.dev);

    uart_ll_clr_intsts_mask(uart2.dev, iflags);

    if(iflags & UART_INTR_RXFIFO_OVF)
        rxbuffer2.overflow = On;

    while(cnt) {

        cnt--;
        c = _uart_ll_read_rxfifo(uart2.dev);

        if(!enqueue_realtime_command3(c)) {

            uint32_t bptr = (rxbuffer2.head + 1) & RX_BUFFER_SIZE_MASK;  // Get next head pointer

            if(bptr == rxbuffer2.tail)                    // If buffer full
                rxbuffer2.overflow = On;                  // flag overflow,
            else {
                rxbuffer2.data[rxbuffer2.head] = (char)c; // else add data to buffer
                rxbuffer2.head = bptr;                    // and update pointer
            }
        }
    }
}

uint16_t static serial2Available (void)
{
    uint16_t head = rxbuffer2.head, tail = rxbuffer2.tail;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

uint16_t static serial2TxCount (void)
{
    return uart_ll_is_tx_idle(uart2.dev) ? 0 : (uint16_t)_uart_ll_get_txfifo_count(uart2.dev) + 1;
}

uint16_t static serial2RXFree (void)
{
    uint16_t head = rxbuffer2.head, tail = rxbuffer2.tail;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

bool static serial2PutC (const char c)
{
    UART_MUTEX_LOCK(&uart2);
    serialPutC(c);
    while(_uart_ll_get_txfifo_count(uart2.dev) == uart2.tx_len) {
        if(!hal.stream_blocking_callback())
            return false;
    }

    _uart_ll_write_txfifo(uart2.dev, c);

    UART_MUTEX_UNLOCK(&uart2);

