grblHAL/ESP32/main/uart_serial.c
    return true;
}

void static serial2WriteS (const char *data)
{
    char c, *ptr = (char *)data;

    while((c = *ptr++) != '\0')
        serial2PutC(c);
}

//
// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
void static serial2Write (const char *s, uint16_t length)
{
    char *ptr = (char *)s;

    while(length--)
        serial2PutC(*ptr++);
}

int16_t static serial2Read (void)
{
    UART_MUTEX_LOCK(&uart2);

    int16_t data;
    uint16_t bptr = rxbuffer2.tail;

    if(bptr == rxbuffer2.head) {
        UART_MUTEX_UNLOCK(&uart2);
        return -1; // no data available else EOF
    }

    data = rxbuffer2.data[bptr++];                 // Get next character, increment tmp pointer
    rxbuffer2.tail = bptr & (RX_BUFFER_SIZE - 1);  // and update pointer

    UART_MUTEX_UNLOCK(&uart2);

    return data;
}

IRAM_ATTR static void serial2Flush (void)
{
    UART_MUTEX_LOCK(&uart2);

    _uart_flush(&uart2, false);

    rxbuffer2.tail = rxbuffer2.head;
    rxbuffer2.overflow = Off;

    UART_MUTEX_UNLOCK(&uart2);
}

IRAM_ATTR static void serial2TxFlush (void)
{
    UART_MUTEX_LOCK(&uart2);

    _uart_flush(&uart2, true);

    UART_MUTEX_UNLOCK(&uart2);
}

IRAM_ATTR static void serial2Cancel (void)
{
    UART_MUTEX_LOCK(&uart2);

    rxbuffer2.data[rxbuffer2.head] = ASCII_CAN;
    rxbuffer2.tail = rxbuffer2.head;
    rxbuffer2.head = (rxbuffer2.tail + 1) & (RX_BUFFER_SIZE - 1);

    UART_MUTEX_UNLOCK(&uart2);
}

static bool serial2SuspendInput (bool suspend)
{
    bool ok;

    UART_MUTEX_LOCK(&uart2);

    ok = stream_rx_suspend(&rxbuffer2, suspend);

    UART_MUTEX_UNLOCK(&uart2);

    return ok;
}

IRAM_ATTR static bool serial2Disable (bool disable)
{
    UART_MUTEX_LOCK(&uart2);

    uart_ll_disable_intr_mask(uart2.dev, rx_int_flags);

    if(!disable) {
        // Clear and enable interrupts
        _uart_flush(&uart2, false);
        rxbuffer2.tail = rxbuffer2.head;
        uart_ll_clr_intsts_mask(uart2.dev, rx_int_flags);
        uart_ll_ena_intr_mask(uart2.dev, rx_int_flags);
    }

    UART_MUTEX_UNLOCK(&uart2);

    return true;
}

static bool serial2SetBaudRate (uint32_t baud_rate)
{
    stream_status[2].baud_rate = baud_rate;

    uartSetBaudRate(&uart2, baud_rate);

    return true;
}

static bool serial2SetFormat (serial_format_t format)
{
    stream_status[2].format = format;

    uartSetFormat(&uart2, format);

    return true;
}

static bool serial2EnqueueRtCommand (char c)
{
    return enqueue_realtime_command3(c);
}

static enqueue_realtime_command_ptr serial2SetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command3;

    if(handler)
        enqueue_realtime_command3 = handler;

    return prev;
}

static const io_stream_t *serial2Init (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 2,
        .is_connected = stream_connected,
        .read = serial2Read,
        .write = serial2WriteS,
        .write_n =  serial2Write,
        .write_char = serial2PutC,
        .enqueue_rt_command = serial2EnqueueRtCommand,
        .get_rx_buffer_free = serial2RXFree,
        .get_rx_buffer_count = serial2Available,
        .get_tx_buffer_count = serial2TxCount,
        .reset_write_buffer = serial2TxFlush,
        .reset_read_buffer = serial2Flush,
        .cancel_read_buffer = serial2Cancel,
        .suspend_read = serial2SuspendInput,
        .set_baud_rate = serial2SetBaudRate,
        .set_format = serial2SetFormat,
        .disable_rx = serial2Disable,
        .set_enqueue_rt_handler = serial2SetRtHandler
    };

    if(serial[2].flags.claimed)
        return NULL;

    serial[2].flags.claimed = On;
    stream_status[2].baud_rate = baud_rate;

    memcpy(&uart2, &_uart_bus_array[2], sizeof(uart_t)); // use UART 2

    uartConfig(&uart2, baud_rate);

    serial2Flush();
#ifdef UART2_TX_PIN
    uartEnableInterrupt(&uart2, _uart2_isr, true);
#else
    uartEnableInterrupt(&uart2, _uart2_isr, false);
#endif

    return &stream;
}

#endif // SERIAL2_PORT
